Repository: aaclause/nvda-markdownForever
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: vi

source: No title
vi: Không có tên

source: No content
vi: Không có nội dung

source: Index of {path}
vi: Mục lục {path}

source: Error 404
vi: Lỗi 404

source: The requested URL “{path}” was not found
vi: Không tìm thấy URL “{path}” được yêu cầu

source: Documentation
vi: Tài liệu hướng dẫn

source: Documentation menu
vi: Trình đơn tài liệu hướng dẫn

source: Open the add-on documentation in this language.
vi: Mở tài liệu hướng dẫn sử dụng add-on bằng ngôn ngữ này.

source: Settings
vi: Cài đặt

source: Add-on settings
vi: Cài đặt add-on

source: HTTP server
vi: Máy chủ HTTP

source: Web server
vi: Máy chủ web

source: &Check for update
vi: Kiểm tra &cập nhật

source: Checks if update is available
vi: Kiểm tra bản cập nhật

source: &Web site
vi: Trang &Web

source: Open the add-on website.
vi: Mở trang web của add-on.

source: No text
vi: Không có văn bản

source: Show the HTML source from Markdown
vi: Hiển thị mã nguồn HTML từ Markdown

source: HTML to Markdown conversion
vi: Chuyển đổi từ HTML thành Markdown

source: Markdown to HTML conversion. The result is displayed in a virtual buffer of NVDA
vi: Chuyển từ Markdown thành HTML. Kết quả hiển thị trên màn hình ảo của NVDA

source: Markdown to HTML conversion. The result is displayed in your default browser
vi: Chuyển từ Markdown thành HTML. Kết quả hiển thị trên trình duyệt mặc định của bạn

source: HTML source copied to clipboard
vi: Đã chép mã nguồn html vào bộ nhớ tạm

source: Markdown to HTML source conversion. The result is copied to clipboard
vi: Chuyển từ Markdown thành mã nguồn HTML. Đã chép kết quả vào bộ nhớ tạm

source: Formatted HTML copied to clipboard
vi: Đã chép định dạng HTML vào bộ nhớ tạm

source: An error occured
vi: Có lỗi xảy ra

source: Markdown to formatted HTML conversion. The result is copied to clipboard
vi: Chuyển từ Markdown thành định dạng HTML. Đã chép kết quả vào bộ nhớ tạm

source: Markdown copied to clipboard
vi: Đã chép Markdown vào bộ nhớ tạm

source: HTML to Markdown conversion. The result is copied to clipboard
vi: Chuyển từ HTML thành Markdown. Đã chép kết quả vào bộ nhớ tạm

source: Interactive mode
vi: Chế độ tương tác

source: HTML source
vi: Mã nguồn HTML

source: C&onvert to:
vi: Chuyển đổi &thành:

source: Generate corresponding &metadata from HTML source
vi: Tạo &siêu dữ liệu tương ứng từ mã nguồn HTML

source: &Generate a table of contents
vi: &Tạo mục lục

source: Try to automatically &number headings
vi: Cố gắng đánh &số tự động cho tiêu đề

source: Enable e&xtra tags
vi: Bật các &thẻ bổ sung

source: Allow extratags bac&k translation
vi: Cho phép dịch &ngược các thẻ bổ sung

source: &Detect extratags if possible
vi: Nhận &dạng các thẻ bổ sung khi có thể

source: &Title:
vi: &Tên:

source: S&ubtitle:
vi: Tên &phụ:

source: Pat&h:
vi: Đường &dẫn

source: Bro&wse...
vi: &Duyệt...

source: File n&ame:
vi: Tên tập ti&n:

source: HTML temp&late to use:
vi: Dùng &mẫu HTML:

source: Corres&ponding metadata block
vi: Khối siêu dữ liệu &tương ứng

source: Show in &virtual buffer
vi: Hiển thị trên &màn hình ảo

source: Show in &browser
vi: Hiển thị trên &Trình duyệt

source: &Copy to clipboard
vi: &Chép vào bộ nhớ tạm

source: &Save the result as...
vi: &Lưu kết quả...

source: Save the sou&rce as...
vi: Lưu &mã nguồn...

source: Choose a folder
vi: Chọn thư mục

source: Select the location
vi: Chọn đường dẫn

source: Do you want to conserve extra-tags? If you select No, extra-tags will be interpreted before saving.
vi: Bạn có muốn giữ lại các thẻ bổ sung không? Nếu không, các thẻ này sẽ được thông dịch trước khi lưu lại.

source: Save the result as
vi: Lưu kết quả

source: Save the source as
vi: Lưu mã nguồn

source: Show in browser
vi: Hiển thị trên trình duyệt

source: Show in virtual buffer
vi: Hiển thị trên màn hình ảo

source: Copy to clipboard
vi: Chép vào bộ nhớ tạm

source: Turn HTML into equivalent Markdown-structured text
vi: Chuyển HTML thành văn bản Markdown tương ứng

source: Conservatively convert html to markdown
vi: Chuyển html thành markdown

source: Replace single new line characters with <br> when True
vi: Thay thế kí tự dòng mới đơn với <br> khi đúng

source: Disable _ and __ for em and strong
vi: Tắt _ và __ cho in đậm và nhấn mạnh

source: Allow lists to be cuddled to the preceding paragraph
vi: Cho phép các danh sách được gắn vào đoạn trước

source: Allows a code block to not have to be indented by fencing it with '```' on a line before and after
vi: Cho phép một khối mã nguồn không bị thụt lề bằng cách khoanh vùng lại với '```' trên một dòng trước và sau

source: Support footnotes as in use on daringfireball.net and implemented in other Markdown processors (tho not in Markdown.pl v1.0.1)
vi: Hỗ trợ các chú thích chân trang như đã dùng trên trang daringfireball.net và đã bổ sung trong các trình xử lý Markdown khác (không có trong Markdown.pl v1.0.1)

source: Adds "id" attributes to headers. The id value is a slug of the header text
vi: Thêm thuộc tính "id" vào các tiêu đề. Giá trị id là một phần của nội dung tiêu đề

source: Takes a dict mapping html tag names (lowercase) to a string to use for a "class" tag attribute. Currently only supports "pre", "code", "table" and "img" tags
vi: Tạo sơ đồ ghép tên của các thẻ html (chữ thường) vào một chuỗi để dùng cho thuộc tính thẻ "class". Hiện chỉ hỗ trợ các thẻ "pre", "code", "table" và "img"

source: Auto-link given regex patterns in text (e.g. bug number references, revision number references)
vi: Tự liên kết biểu thức phổ thông cho trước trong nội dung (ví dụ: bug number references, revision number references)

source: Allow the use of markdown="1" in a block HTML tag to have markdown processing be done on its contents
vi: Cho phép sử dụng markdown="1" trong một khối thẻ HTML để việc xử lý markdown được hoàn thành trên nội dung của nó

source: Add rel="nofollow" to all <a> tags with an href.
vi: Thêm rel="nofollow" vào tất cả thẻ <a> với href.

source: Create counters to number tables, figures, equations and graphs
vi: Tạo số đếm cho bảng, hình dáng, công thức và ảnh

source: Treats unindented Python interactive shell sessions as <code> blocks
vi: Xem các phần chưa thụt lề trong cửa sổ tương tác Python là các khối <code>

source: Fancy quote, em-dash and ellipsis handling
vi: Quản lý trích dẫn ưa thích, gạch nối đậm và dấu chấm lửng

source: A special kind of blockquote commonly hidden behind a click on SO
vi: Một loại trích dẫn đặc biệt thường ẩn sau một click trên SO

source: Parse ~~strikethrough~~ formatting
vi: Phân tích định dạng ~~strikethrough~~

source: Add target="_blank" to all <a> tags with an href. This causes the link to be opened in a new tab upon a click
vi: Thêm target="_blank" vào tất cả các thẻ <a> với href. Điều này làm cho liên kết được mở trong một thẻ mới khi kích hoạt

source: Tables using the same format as GFM and PHP-Markdown Extra
vi: Bảng biểu sử dụng định dạng giống như GFM và PHP-Markdown Extra

source: Requires atx style headers to have a space between the # and the header text. Useful for applications that require twitter style tags to pass through the parser
vi: Yêu cầu kiểu tiêu đề atx phải có một khoảng trắng giữa số và nội dung tiêu đề. Hữu ích cho các ứng dụng yêu cầu kiểu thẻ của twitter để bỏ qua bộ phân tích

source: Allows github-style task lists (i.e. check boxes)
vi: Cho phép kiểu danh sách nhiệm vụ của github (ví dụ: hộp kiểm)

source: Parse --underline-- formatting
vi: Phân tích định dạng --gạch dưới--

source: Look for an Emacs-style markdown-extras file variable to turn on Extras
vi: Tìm một tập tin dạng biến Emacs-style markdown-extras để bật bổ sung

source: Google Code Wiki table syntax support
vi: Bảng hỗ trợ cú pháp cho Google Code Wiki

source: Passes one-liner processing instructions and namespaced XML tags
vi: Bỏ qua giới thiệu xử lý one-liner và các thẻ namespaced XML

source: Invalid file path
vi: Đường dẫn tập tin không hợp lệ

source: Unable to guess the encoding
vi: Không đoán được bảng mã

source: Unable to include “{filePath}”
vi: Không bao gồm được “{filePath}”

source: Just the HTML from your Markdown
vi: Chỉ chuyển thành HTML từ Markdown

source: A minimal template provided by the add-on
vi: Một mẫu minimal được cung cấp bởi add-on

source: Metadata and extra tags error. '%s' value was not recognized for lang field.
vi: Lỗi siêu dữ liệu và các thẻ bổ sung. Giá trị '%s' không được nhận dạng cho ô lang.

source: Table of contents
vi: Mục lục

source: Markdown to HTML conversion
vi: Chuyển từ Markdown thành HTML

source: Markdown to HTML conversion (preview)
vi: Chuyển từ Markdown thành HTML (Xem trước)

source: Markdown to HTML source conversion
vi: Chuyển từ Markdown thành mã nguồn HTML

source: General
vi: Chung

source: Default &action in interactive mode:
vi: Hành động &mặc định trong chế độ tương tác

source: Markdown Engi&ne:
vi: Bộ công &cụ Markdown

source: Markdo&wn2 extras:
vi: Markdo&wn2 bổ sung:

source: &Browse...
vi: &Duyệt...

source: HTML Templates
vi: Mẫu HTML

source: HTML templates &list:
vi: Danh &sách mẫu HTML:

source: Set as &default template
vi: Đặt làm mẫu &mặc định

source: &Edit
vi: Chỉnh &sửa

source: &Add
vi: T&hêm

source: &Remove
vi: &Gỡ

source: Are you sure to want to delete the '%s' template?
vi: Bạn có chắc chắn xóa mẫu '%s' không?

source: Confirmation
vi: Xác nhận

source: Add template
vi: Thêm mẫu

source: Edit template
vi: Chỉnh sửa mẫu

source: &Name:
vi: &Tên:

source: &Description:
vi: &Mô tả:

source: &Content:
vi: &Nội dung:

source: Wrong value for template name field. Field must contain only letters in lowercase ({letters}), digits ({digits}), hyphen ({hyphen}) or underscore ({underscore}). A maximum of {maxCharTemplateName} characters. The following name is not allowed: "default".
vi: Giá trị sai cho ô nhập tên mẫu. Ô này chỉ được phép chứa chữ thường ({letters}), số ({digits}), dấu gạch ngang ({hyphen}) hay gạch dưới ({underscore}). Số ki tự tối đa của {maxCharTemplateName}. Các tên sau đây không được chấp nhận: "default".

source: Content field empty.
vi: Ô nội dung bị bỏ trống

source: Content field invalid. The following required tags are missing: {missingFields}. Each tag must be surrounded by braces. E.g.: {eg}.
vi: Ô nội dung không hợp lệ. Thiếu các thẻ bắt buộc sau: {missingFields}. Mỗi thẻ phải được khoanh lại bằng dấu ngoặc nhọn. Ví dụ: {eg}.

source: &Host:
vi: Nơi lưu trữ:

source: &Port:
vi: &Cổng

source: Default &encoding:
vi: Bảng &mã mặc định:

source: Root &folders:
vi: &Thư mục gốc:

source: New version available, version %s. Do you want to download it now?
vi: Đã có phiên bản mới, %s. Bạn có muốn tải về không?

source: You are up-to-date. %s is the latest version.
vi: Bạn đang dùng bản %s là phiên bản mới nhất.

source: Oops! There was a problem downloading for update. Please retry later or download and install manually via %s. Do you want to open this URL in your browser now?
vi: Lỗi tải bản cập nhật. Vui lòng thử lại sau hoặc tải và cài thủ công qua %s. Bạn có muốn mở đường dẫn này trên trình duyệt ngay bây giờ không?

source: An update check dialog is already running!
vi: Đã có một hộp thoại kiểm tra cập nhật đang chạy!

source: {addonName}'s update
vi: Cập nhật {addonName}'

source: Invalid document
vi: Tài liệu không hợp lệ

source: Full-featured Markdown and HTML converter for NVDA
vi: Bộ chuyển đổi Markdown và HTML đầy đủ tính năng cho NVDA
